In [1]:
import pandas as pd
import numpy as np

## Transactions table EDA and Data Cleaning

In [5]:
# read in table
transactions_df = pd.read_csv('data_files/201904 sales reciepts.csv')
transactions_df.head()

,transaction_id,transaction_date,transaction_time,sales_outlet_id,staff_id,customer_id,instore_yn,order,line_item_id,product_id,quantity,line_item_amount,unit_price,promo_item_yn
0,7,2019-04-01,12:04:43,3,12,558,N,1,1,52,1,2.50,2.50,N
1,11,2019-04-01,15:54:39,3,17,781,N,1,1,27,2,7.00,3.50,N
2,19,2019-04-01,14:34:59,3,17,788,Y,1,1,46,2,5.00,2.50,N
3,32,2019-04-01,16:06:04,3,12,683,N,1,1,23,2,5.00,2.50,N
4,33,2019-04-01,19:18:37,3,17,99,Y,1,1,34,1,2.45,2.45,N

In [7]:
# find num of rows and columns
transactions_df.shape

(49894, 14)

In [8]:
# check for nulls
transactions_df.isnull().sum()

transaction_id      0
transaction_date    0
transaction_time    0
sales_outlet_id     0
staff_id            0
customer_id         0
instore_yn          0
order               0
line_item_id        0
product_id          0
quantity            0
line_item_amount    0
unit_price          0
promo_item_yn       0
dtype: int64

In [12]:
# check for duplicate rows
transactions_df.duplicated().value_counts()

False    49894
dtype: int64

In [14]:
# check data types
transactions_df.dtypes

transaction_id        int64
transaction_date     object
transaction_time     object
sales_outlet_id       int64
staff_id              int64
customer_id           int64
instore_yn           object
order                 int64
line_item_id          int64
product_id            int64
quantity              int64
line_item_amount    float64
unit_price          float64
promo_item_yn        object
dtype: object

In [15]:
transactions_df.describe()

,transaction_id,sales_outlet_id,staff_id,customer_id,order,line_item_id,product_id,quantity,line_item_amount,unit_price
count,49894.000000,49894.000000,49894.000000,49894.000000,49894.000000,49894.000000,49894.000000,49894.000000,49894.000000,49894.000000
mean,869.056059,5.351846,25.359582,2282.324468,1.173428,1.631860,47.878983,1.438209,4.682646,3.384645
std,857.863149,2.074796,12.466490,3240.551757,1.025445,1.412881,17.928355,0.543039,4.436668,2.682545
min,1.000000,3.000000,6.000000,0.000000,1.000000,1.000000,1.000000,1.000000,0.000000,0.800000
25%,223.000000,3.000000,15.000000,0.000000,1.000000,1.000000,33.000000,1.000000,3.000000,2.500000
50%,481.000000,5.000000,26.000000,0.000000,1.000000,1.000000,47.000000,1.000000,3.750000,3.000000
75%,1401.000000,8.000000,41.000000,5412.000000,1.000000,1.000000,60.000000,2.000000,6.000000,3.750000
max,4203.000000,8.000000,45.000000,8501.000000,9.000000,12.000000,87.000000,8.000000,360.000000,45.000000

In [17]:
transactions_df.nunique()

transaction_id       4203
transaction_date       29
transaction_time    26074
sales_outlet_id         3
staff_id               25
customer_id          2248
instore_yn              3
order                   9
line_item_id           11
product_id             80
quantity                6
line_item_amount       77
unit_price             41
promo_item_yn           2
dtype: int64

### Only 29 dates, only 3 stores with records

In [20]:
# clean transaction_date column
transactions_df.transaction_date.unique()

array(['2019-04-01', '2019-04-02', '2019-04-03', '2019-04-04',
       '2019-04-05', '2019-04-06', '2019-04-07', '2019-04-08',
       '2019-04-09', '2019-04-10', '2019-04-11', '2019-04-12',
       '2019-04-13', '2019-04-14', '2019-04-15', '2019-04-16',
       '2019-04-17', '2019-04-18', '2019-04-19', '2019-04-20',
       '2019-04-21', '2019-04-22', '2019-04-23', '2019-04-24',
       '2019-04-25', '2019-04-26', '2019-04-27', '2019-04-28',
       '2019-04-29'], dtype=object)

In [22]:
# convert to date
transactions_df['transaction_date'] = pd.to_datetime(transactions_df['transaction_date'])

In [ ]:
week_df = transactions_df.resample